[ItemDefs.ID_Iris_GyroBanjo MissionItemDefinition]
UseFailureCharacterMessage="you are right %s Use this thing."
ItemName="High baron of gold"
PickupMessage="Understanding %s"
UseFailureLevelMessage="You need at least %d to use this item.."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="As usual"

[ItemDefs.ID_Iris_GyroBanjo2 MissionItemDefinition]
UseFailureCharacterMessage="It has to be done %s Use these words."
ItemName="swim with the baron's gold"
PickupMessage="close to you %s"
UseFailureLevelMessage="You must have at least %d points to use this feature.."
UseFailureConstraintsMessage="You cannot use this product.."
NoManufacturerName="taking everything into consideration"

[ItemDefs.ID_Iris_GyroBanjo2:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="One weapon used is the "Lime Baron".."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_Iris_GyroBanjo3 MissionItemDefinition]
UseFailureCharacterMessage="you need %s Use this code."
ItemName="gold comes out with it"
PickupMessage="for you %s"
UseFailureLevelMessage="You must be level %d to use this feature."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="Leader"

[ItemDefs.ID_Iris_GyroBanjo3:AttributePresentationDefinition_3 AttributePresentationDefinition]
Description="A few ropes used by impatient barons."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_Iris_GyroBanjo:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Some of the worn necklaces were broken.."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_Iris_GyroBanjoR3 MissionItemDefinition]
UseFailureCharacterMessage="You should also %s use this option."
ItemName="Paralyzed golden shower"
PickupMessage="Your own advice %s"
UseFailureLevelMessage="You must be at least %d level to use this feature."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="Generally speaking"

[ItemDefs.ID_Iris_GyroBanjoR3:AttributePresentationDefinition_4 AttributePresentationDefinition]
Description="Account segment used by Mango Baron."
NoConstraintText=""
Suffix=""
Prefix=""

